# Задайте последовательность чисел. Напишите программу,
# которая выведет список неповторяющихся элементов исходной последовательности.
# *Пример*
# - при [1, 1, 2, 3, 3, 4, 1, 5, 7, 8, 8, 7, 9]     ->        [2, 4, 5, 9]

lst1 = [1, 1, 2, 3, 3, 4, 1, 5, 7, 8, 8, 7, 9]
lst2 = []
for i in range(len(lst1)):
    count = 1
    for j in range(len(lst1)):
        if i == j:
            continue
        if lst1[i] == lst1[j]:
            count += 1
    if count == 1:
        lst2.append(lst1[i])
print(lst2)
